Autodesk.Revit.DB.Structure.ConnectionTypeChangedServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.ConnectionTypeChangedServiceData.ConnectionId
The id of the structural connection element.
Since:
2017

Autodesk.Revit.DB.Structure.ConnectionTypeChangedServiceData.Document
The current document.
Since:
2017

Autodesk.Revit.DB.Structure.ConnectionTypeChangedServiceData
The data needed by connection type changed server.
Remarks:
It's exposed in internal API.
Since:
2017